app/views/students/index.html.erb

SELECT  `choose_courses`.* FROM `choose_courses` WHERE (`choose_courses`.`deleted_at` IS NULL) AND `choose_courses`.`student_id` = 1 LIMIT 1
---
          <td class="action">
            <% if ChooseCourse.find_by_student_id(student.id).blank? %>