app/views/choose_courses/index.html.erb

          <td class="ac"><%= choose_course.code %></td>
          <td class="ac"><%= Course.find_by_id(choose_course.course_id).code %></td>
---
SELECT  `courses`.* FROM `courses` WHERE (`courses`.`deleted_at` IS NULL) AND `courses`.`id` = 5 LIMIT 1