app/controllers/choose_courses_controller.rb

SELECT `choose_courses`.* FROM `choose_courses` INNER JOIN `courses` ON `courses`.`id` = `choose_courses`.`course_id` AND (courses.deleted_at is NULL) AND (`courses`.`deleted_at` IS NULL) INNER JOIN `students` ON `students`.`id` = `choose_courses`.`student_id` AND (students.deleted_at is NULL) AND (`students`.`deleted_at` IS NULL) WHERE (`choose_courses`.`deleted_at` IS NULL)
SELECT `students`.* FROM `students` LEFT OUTER JOIN `choose_courses` ON (`students`.`id` = `choose_courses`.`student_id`) AND choose_courses.deleted_at is null WHERE (`students`.`deleted_at` IS NULL) AND (choose_courses.course_id = 5 )  ORDER BY choose_courses.created_at
SELECT  `choose_courses`.* FROM `choose_courses` INNER JOIN `courses` ON `courses`.`id` = `choose_courses`.`course_id` AND (courses.deleted_at is NULL) AND (`courses`.`deleted_at` IS NULL) INNER JOIN `students` ON `students`.`id` = `choose_courses`.`student_id` AND (students.deleted_at is NULL) AND (`students`.`deleted_at` IS NULL) WHERE (`choose_courses`.`deleted_at` IS NULL) AND (courses.name like '%11%') LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `choose_courses` INNER JOIN `courses` ON `courses`.`id` = `choose_courses`.`course_id` AND (courses.deleted_at is NULL) AND (`courses`.`deleted_at` IS NULL) INNER JOIN `students` ON `students`.`id` = `choose_courses`.`student_id` AND (students.deleted_at is NULL) AND (`students`.`deleted_at` IS NULL) WHERE (`choose_courses`.`deleted_at` IS NULL)
---
  def index
    @choose_courses = ChooseCourse.joins(:course).joins(:student)
    if request.post?
      if params[:choose_course].present? && params[:choose_course][:coucode].present?
        @choose_courses = @choose_courses.where("courses.code like '%#{params[:choose_course][:coucode]}%'").paginate(:page => params[:page],:per_page => 10)