app/controllers/courses_controller.rb

SELECT  `courses`.* FROM `courses` WHERE (`courses`.`deleted_at` IS NULL) LIMIT 10 OFFSET 0
---
  def index
    if request.post?
      search
    else
      @courses = Course.paginate(:page => params[:page],:per_page => 10)

SELECT  `courses`.* FROM `courses` WHERE (`courses`.`deleted_at` IS NULL) AND `courses`.`id` = 6 LIMIT 1
---
  def show
    @course = Course.find_by_id(params[:id])

SELECT  `courses`.* FROM `courses` WHERE (`courses`.`deleted_at` IS NULL) AND `courses`.`id` = 6 LIMIT 1
---
  def edit
    @course = Course.find_by_id(params[:id])

SELECT  `courses`.* FROM `courses` WHERE (`courses`.`deleted_at` IS NULL) AND `courses`.`id` = 6 LIMIT 1
UPDATE `courses` SET `description` = '', `updated_at` = '2016-10-09 21:38:53' WHERE `courses`.`id` = 6
---
  def update
      @course = Course.find_by_id(params[:id])
      temp_params = course_params
      if @course.update(temp_params)

SELECT  `courses`.* FROM `courses` WHERE (`courses`.`deleted_at` IS NULL) LIMIT 10 OFFSET 0
---
  def add_course
    if request.post?
      search
    else
      @courses = Course.paginate(:page => params[:page],:per_page => 10)