app/controllers/students_controller.rb

  def index
    if request.post?
      if student_params[:code].blank? && student_params[:name].blank?
        @students = Student.paginate(:page => params[:page],:per_page => 10)
---
SELECT  `students`.* FROM `students` WHERE (`students`.`deleted_at` IS NULL) LIMIT 10 OFFSET 0

  def select_course
    if params[:course_id].present?
      choose_course = ChooseCourse.new({:course_id => params[:course_id],:student_id => params[:student_id]})
      choose_course.code = params[:course_id]+"_"+params[:student_id]
      choose_course.code = DateTime.now
      choose_course.save
---
INSERT INTO `choose_courses` (`course_id`, `student_id`, `code`, `created_at`, `updated_at`) VALUES (5, 1, '2016-10-09T21:17:22+08:00', '2016-10-09 21:17:22', '2016-10-09 21:17:22')